{
  "entries": [
    {
      "title": "The Beginning",
      "description": "The Beginning of something not so great",
      "date": "Feb 10, 2025",
      "entry": "Well, you read the title. This is The Beginning, the start of my philosophical journaling. Nothing here should be taken to heart and everything here are my own slightly shitty opinions. Expect grammar mistakes and lots of them. Usually written when I'm high and I will go over and talk about topics of all sorts. If you're reading this, then hi |˶˙ᵕ˙ )ﾉﾞ"
    },
    {
      "title": "Magic Mushrooms",
      "description": "My experience with Psilocybin",
      "date": "Feb 16, 2025",
      "entry": "Here I go, my experience with Magic Mushrooms and Psilocybin. It was a pretty positive experience overall, it felt out of this world in some sort of a way. I was thinking things I couldn't comprehend normally, but I was comprehending just fine while on them. It was almost as if I solved the key to life, it's hard to put it into words, but this was just my experience. I am having a hard time recalling everything, TBH, and I wonder if there is some sort of way we as humans can extract and use this information. Everything suddenly made sense to me, even if it didn't beforehand. On one hand, I feel more at peace with my life, while on the other hand, I strive to understand exactly what happened. Next time I take them, I want to set the intention for myself. This was my first time ever taking them, and I wanted to know what it was like to experience it. Now that I have an understanding of what exactly it can do, I strive to find out more. I feel as if it will drive me into insanity if I don't."
    },
    {
      "title": "Death",
      "description": "Death",
      "date": "Feb 24, 2025",
      "entry": "Everybody has different views as to what happens. Personally, since I am an atheist, I don't believe in any sort of afterlife. When we die, our brains and organs stop, everything you've ever heard, seen, or experienced was all formulated in your brain. This includes all knowledge about religion. When your brain stops, you will not see, hear, feel, or experience anything. Just the thought of death is creepy in itself. If you get killed, everything will be gone, and you will cease to exist. It's impossible to comprehend what happens after you die because it's nothing. People can just have their lives stripped away, and they won't know it or care. People get killed daily, just like that, boom. It's like they were never here, so what do we do? We fill up land with dead bodies in overpriced wooden boxes. In my personal opinion, unless you can harvest organs to donate, keeping the dead body around is kind of pointless..."
    },
    {
      "title": "Atheism",
      "description": "Let's talk about atheism",
      "date": "Feb 26, 2025",
      "entry": "Atheism is an absence of belief in the existence of deities. No god, no deities, and no supernatural beings. I have been an atheist for longer than I can remember. When I was growing up, I would go to church with my grandparents every now and then. I would also attend a lot of Wednesday nights and went to a church preschool. As a family, we stopped going to church for a few years. We moved states and started to attend church again, but by this point, I was already questioning religions and belief in religion as a whole. I mean, there are thousands and thousands of religions and theological beliefs, but this one right here is the correct one! And don't even get me started on all the 'Test of faith' bullshit. If there is a god, let's use Christianity as an example. If Christianity and god were real, why did God allow for the creation of Islam? Some Christians may say to test your faith. Now, if Islam is real, you ask the question, why did God allow the creation of other religions? Some Muslims may say to test your faith. Well, now I don't know where to go, which one is real. Then we get to a second roadblock. It is generally considered that Christianity and Islam worship the same God in the sense that they worship God as eternal, omniscient, omnipotent, and benevolent. Both religions teach that God is the ultimate source of moral order and the judge of human actions. Now, jumping subjects, some people believe that the parameters for human life on Earth are so precise that there has to be some sort of deity or god who created humans to live on Earth. However, there is a massive universe out there with an estimated 10^24 (1 septillion) planets in the observable universe, which continues as there are parts of the universe we cannot observe yet. All of those planets could have had life on them, but the parameters didn't function with life, and some planets probably do have life on them. We are no different from one of those planets. Why us, you may ask? Why are we alive? For that, I don't have an answer. All of our knowledge was gained on Earth, centered around Earth. For all we know, there could be another planet out there exactly like ours with people having the same sort of thoughts that we have."
    },
    {
      "title": "Predetermination",
      "description": "Let's talk about the predetermination of the universe.",
      "date": "Feb 26, 2025",
      "entry": "Some people believe that all metrics of their life are predetermined, or even that the entire universe is predetermined. 3000 years ago, it was already predetermined that we would all be here, all the human life advances that were made along the way, and everything that will be in 3000 years from now. There is no way to prove this theory wrong or right, especially in a theological setting. Things like Free Will exist. You are faced with a decision, and you have free will to handle the decision either way. But you may ask, 'What if my decision was predetermined?' So you switch your decision, then you think, 'What if my decision to change my decision was predetermined?' and so on and so forth. This is a type of epistemic paradox. It challenges our understanding of this subject, not because the events themselves are paradoxical, but because our ability to know or determine their nature is caught in a recursive loop that prevents definitive knowledge of the universe's fundamental nature."
    }
  ]
}
